bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
static void reset_host(void) {
  m61_text::cancel();
  scripts.clear();
  range_reads = 0;
  executed_commands = 0;
  clear_count = 0;
  active_program_steps = core_61::CLASSIC_PROGRAM_STEP;
  boundary_hook = nullptr;
  boundary_user_data = nullptr;
  command_hooks.clear();
  next_command_hook = 1;
  command_sequence = 0;
  context_saves = 0;
  context_restores = 0;
  reinit_count = 0;
  host_angle_unit = DEGREE;
  saved_context_angle = DEGREE;
  fake_millis = 0;
  executed_lines.clear();
  executed_in_trap.clear();
  m_IK1302.comma = 0;
}

static void add_script(const char* name, const std::string& source,
                       u16 parent_id = program_store::ROOT_ID) {
  scripts.push_back({name, source, parent_id});
}

static m61_text::Error require_error(void) {
  m61_text::Error error = {};
  assert(m61_text::last_error(error));
  return error;
}

static bool fire_program_boundary(u8 address, u8 opcode = 0) {
  assert(boundary_hook != nullptr);
  const core_61::Mk61ProgramBoundaryContext context = {address, opcode};
  return boundary_hook(context, boundary_user_data);
}

static u8 fire_mk61_command(
    u8 opcode,
    core_61::Mk61CommandSource source =
        core_61::Mk61CommandSource::KEYBOARD) {
  command_sequence++;
  core_61::Mk61CommandHookContext before = {
    core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
    source,
    opcode,
    opcode,
    command_sequence
  };
  for(HostCommandHook& hook : command_hooks) {
    if(hook.opcode == opcode &&
       hook.phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE) {
      hook.callback(before, hook.user_data);
    }
  }

  core_61::Mk61CommandHookContext after = {
    core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
    source,
    opcode,
    before.replacement_opcode,
    command_sequence
  };
  for(HostCommandHook& hook : command_hooks) {
    if(hook.opcode == opcode &&
       hook.phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE) {
      hook.callback(after, hook.user_data);
    }
  }
  return before.replacement_opcode;
}

static void test_command_failure_reports_script_and_line(void) {
  reset_host();
  add_script("FAIL", "ok\nbad\nok\n");
  assert(!m61_text::load_program("FAIL"));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "FAIL") == 0);
  assert(error.line == 2);
  assert(std::strcmp(error.message, "terminal command failed") == 0);
  assert(!m61_text::active());
  assert(executed_commands == 2);
}

static void test_long_missing_name_is_truncated_to_error_capacity(void) {
  reset_host();
  const char* name = "1234567890123456789012345678901";
  assert(std::strlen(name) == program_store::NAME_SIZE - 1);
  assert(!m61_text::load_program(name));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "123456789012345") == 0);
  assert(error.line == 0);
  assert(std::strcmp(error.message, "script not found") == 0);
}

static void test_duplicate_and_oversized_labels_fail_before_execution(void) {
  reset_host();
  add_script("DUP", ":same\n:same\nok\n");
  assert(!m61_text::load_program("DUP"));
  m61_text::Error error = require_error();
  assert(error.line == 2);
  assert(std::strcmp(error.message, "duplicate label") == 0);
  assert(executed_commands == 0);

  reset_host();
  add_script("LONG", ":abcdefghijklmnopqrstuvwxyz123456\nok\n");
  assert(!m61_text::load_program("LONG"));
  error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "invalid label") != nullptr);
}

static void test_line_limit_is_enforced_during_indexing(void) {
  reset_host();
  add_script("LINE", std::string(terminal_core::MAX_INPUT_TEXT + 1, 'x') + "\n");
  assert(!m61_text::load_program("LINE"));
  const m61_text::Error error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "line is too long") != nullptr);
}

static void test_indexed_loop_is_budgeted_and_uses_block_reads(void) {
  reset_host();
  std::string source;
  for(int i = 0; i < 200; i++) source += "\n";
  source += ":loop\nrun :loop\n";
  add_script("LOOP", source);

  assert(m61_text::load_program("LOOP"));
  assert(m61_text::active());
  for(int i = 0; i < 32; i++) {
    const int before = executed_commands;
    m61_text::service();
    assert(executed_commands - before <= 8);
  }
  assert(executed_commands > 8);
  assert(range_reads < 200); // старому исполнителю здесь требовались тысячи однобайтовых чтений
  m61_text::cancel();
}

static void test_label_reference_rejects_trailing_tokens(void) {
  reset_host();
  add_script("ARGS", ":loop\nrun :loop extra\n");
  assert(!m61_text::load_program("ARGS"));
  const m61_text::Error error = require_error();
  assert(error.line == 2);
}

static void test_run_waits_and_reports_later_failure(void) {
  reset_host();
  add_script("WAIT", "run\nbad\n");
  assert(m61_text::load_program("WAIT"));
  assert(m61_text::active());
  assert(executed_commands == 1);

  m61_text::service();
  assert(executed_commands == 1); // калькулятор всё ещё работает
  m_IK1302.comma = 0;
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "WAIT") == 0);
  assert(error.line == 2);
}

static void test_print_owns_display_until_root_script_finishes(void) {
  reset_host();
  add_script("DISPLAY", "print \"frame\"\nrun\nret\n");
  assert(m61_text::load_program("DISPLAY"));
  assert(m61_text::active());
  assert(m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_print_off_and_on_control_display_ownership(void) {
  reset_host();
  add_script("DISPLAY", "print off\nrun\nprint on\nrun\nret\n");
  assert(m61_text::load_program("DISPLAY"));
  assert(m61_text::active());
  assert(m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  assert(!m61_text::display_owned());

  m_IK1302.comma = 0;
  m61_text::service();
  assert(!m61_text::active());
  assert(!m61_text::display_owned());
}

static void test_trap_wait_holds_snapshot_and_resumes_at_deadline(void) {
  reset_host();
  add_script("WAIT", "trap 10 run :frame\nrun\nret\n:frame\nprint \"frame\"\nwait 500\nret\n");
  assert(m61_text::load_program("WAIT"));
  assert(fire_program_boundary(10, 0x02));

  m61_text::service();
  assert(m61_text::calculator_suspended());
  assert(m61_text::display_owned());
  assert(context_saves == 1);
  assert(context_restores == 0);

