bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
static void test_reinit_continues_script_and_clears_handlers(void) {
  reset_host();
  add_script(
      "REINIT",
      "bind AE run :pressed\n"
      "trap 10 run :trapped\n"
      "reinit\n"
      "ok\n"
      "ret\n"
      ":pressed\n"
      "ret\n"
      ":trapped\n"
      "ret\n");
  assert(m61_text::load_program("REINIT"));
  assert(reinit_count == 1);
  assert(!m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(executed_lines.size() == 3);
  assert(executed_lines[0] == "reinit");
  assert(executed_lines[1] == "ok");
  assert(executed_lines[2] == "ret");
}

static void test_ret_returns_from_nested_script_and_ends_root(void) {
  reset_host();
  add_script("PARENT", "open CHILD\nbad\n");
  add_script("CHILD", "ret\nbad\n");
  assert(!m61_text::load_program("PARENT"));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.script, "PARENT") == 0);
  assert(error.line == 2);

  reset_host();
  add_script("ROOTRET", "ret\nbad\n");
  assert(m61_text::load_program("ROOTRET"));
  assert(!m61_text::active());
  assert(executed_commands == 1);
  m61_text::Error no_error = {};
  assert(!m61_text::last_error(no_error));
}

int main(void) {
  test_command_failure_reports_script_and_line();
  test_long_missing_name_is_truncated_to_error_capacity();
  test_duplicate_and_oversized_labels_fail_before_execution();
  test_line_limit_is_enforced_during_indexing();
  test_indexed_loop_is_budgeted_and_uses_block_reads();
  test_label_reference_rejects_trailing_tokens();
  test_run_waits_and_reports_later_failure();
  test_print_owns_display_until_root_script_finishes();
  test_print_off_and_on_control_display_ownership();
  test_trap_wait_holds_snapshot_and_resumes_at_deadline();
  test_trap_ret_preserves_user_angle_change();
  test_trap_handler_can_call_a_common_label();
  test_nested_script_returns_to_parent_and_depth_is_bounded();
  test_explicit_id_disambiguates_directory_names();
  test_trap_saves_runs_and_restores_at_exact_address();
  test_trap_is_activated_only_when_its_line_executes();
  test_restarting_same_root_preserves_active_traps();
  test_invalid_traps_fail_before_or_at_run();
  test_trap_handler_requires_ret_and_restores_on_error();
  test_bind_consumes_keyboard_opcode_and_calls_handler();
  test_bind_is_validated_and_activated_only_when_executed();
  test_bind_handler_requires_ret();
  test_bind_limit_and_non_reentrant_handler();
  test_reinit_continues_script_and_clears_handlers();
  test_ret_returns_from_nested_script_and_ends_root();
  std::printf("m61_text_self_test: ok\n");
  return 0;
}
